app/views/flights/show.html.erb


<p>Asientos: <%= @flight.seats.each do |seat| %>
---
SELECT "seats".* FROM "seats" WHERE "seats"."flight_id" = ?  [["flight_id", 2]]