app/views/flights/show.html.erb

SELECT "seats".* FROM "seats" WHERE "seats"."flight_id" = ?  [["flight_id", 3]]
---

<p>Asientos: <%= @flight.seats.each do |seat| %>