app/controllers/bookings_controller.rb

INSERT INTO "bookings" ("user", "seats", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user", "s"], ["seats", "---\n- 1A\n"], ["created_at", "2022-06-11 17:04:42.599133"], ["updated_at", "2022-06-11 17:04:42.599133"]]
---
  def create
    seats = params[:seats].split(";")
    if seats.length > 0 && seats[0].length < 4 && params[:user] != ''
      for seat in seats do
        seat = Seat.find_by(flight: params[:flight_id], row: seat[0..seat.length - 2], column: seat[seat.length - 1])
        if seat
          seat = Seat.update(seat.id, disponibility: false)
        end
      end
      @booking = Booking.new(user: params[:user], seats: seats)
      puts @booking
      if @booking.save