app/controllers/bookings_controller.rb

  def index
    @bookings = Booking.where("user like :user", user: "%#{params[:user]}%")
---
SELECT "bookings".* FROM "bookings" WHERE (user like :user)

  def edit
    @booking = Booking.find(params[:id])
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def update
    new_seats = params[:booking][:seats].split(";")
    @booking = Booking.find(params[:id])
    old_seats = @booking.seats

    if @booking.update(seats: new_seats)
      for seat in old_seats do
        sit = Seat.find_by(flight: @booking.flight, row: seat[0..seat.length - 2], column: seat[seat.length - 1])
        sit.update(disponibility: true)
      end
      for seat in new_seats do
        sit = Seat.find_by(flight: @booking.flight, row: seat[0..seat.length - 2], column: seat[seat.length - 1])
        sit.update(disponibility: false)
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "seats" SET "disponibility" = ?, "updated_at" = ? WHERE "seats"."id" = ?  [["disponibility", 0], ["updated_at", "2022-06-11 17:02:25.164582"], ["id", 118]]
UPDATE "bookings" SET "seats" = ?, "updated_at" = ? WHERE "bookings"."id" = ?  [["seats", "---\n- 3A\n- 4A\n"], ["updated_at", "2022-06-11 21:44:09.375527"], ["id", 9]]
SELECT "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "seats".* FROM "seats" WHERE "seats"."flight_id" = ? AND "seats"."row" = ? AND "seats"."column" = ? LIMIT ?  [["flight_id", 7], ["row", 1], ["column", "A"], ["LIMIT", 1]]
UPDATE "seats" SET "disponibility" = ?, "updated_at" = ? WHERE "seats"."id" = ?  [["disponibility", 1], ["updated_at", "2022-06-11 21:44:09.399340"], ["id", 1036]]
SELECT "seats".* FROM "seats" WHERE "seats"."flight_id" = ? AND "seats"."row" = ? AND "seats"."column" = ? LIMIT ?  [["flight_id", 7], ["row", 3], ["column", "A"], ["LIMIT", 1]]
UPDATE "seats" SET "disponibility" = ?, "updated_at" = ? WHERE "seats"."id" = ?  [["disponibility", 0], ["updated_at", "2022-06-11 21:44:09.408616"], ["id", 1038]]

  def create
    seats = params[:seats].split(";")
    if seats.length > 0 && seats[0].length < 4 && params[:user] != ''
      for seat in seats do
        puts("monu")
        puts(params[:flight_id], seat[0..seat.length - 2], seat[seat.length - 1])
        puts("monu")
        seat = Seat.find_by(flight: params[:flight_id], row: seat[0..seat.length - 2], column: seat[seat.length - 1])
        if seat
          seat = Seat.update(seat.id, disponibility: false)
        end
      end
      @booking = Booking.new(user: params[:user], seats: seats, flight: params[:flight_id])
      if @booking.save
---
SELECT "seats".* FROM "seats" WHERE "seats"."flight_id" = ? AND "seats"."row" = ? AND "seats"."column" = ? LIMIT ?  [["flight_id", 1], ["row", 3], ["column", "A"], ["LIMIT", 1]]
UPDATE "seats" SET "disponibility" = ?, "updated_at" = ? WHERE "seats"."id" = ?  [["disponibility", 0], ["updated_at", "2022-06-12 21:47:20.111725"], ["id", 3]]
INSERT INTO "bookings" ("user", "seats", "created_at", "updated_at", "flight") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user", "Seba"], ["seats", "---\n- 1A\n- 1B\n"], ["created_at", "2022-06-13 00:17:53.018819"], ["updated_at", "2022-06-13 00:17:53.018819"], ["flight", 1]]

  def destroy
    @booking = Booking.find(params[:id])
    @booking.destroy
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "bookings" WHERE "bookings"."id" = ?  [["id", 2]]