app/controllers/flights_controller.rb

  def index
    @flights = Flight.all
    bookings = Booking.all
---
SELECT "flights".* FROM "flights"
SELECT "bookings".* FROM "bookings"