app/controllers/flights_controller.rb

  def statistics
    @all = Flight.count
    @past = Flight.where("date < :datenow", datenow: Date.today).count
    @future = Flight.where("date > :datenow", datenow: Date.today).count
    @taken = 0
    @all_seats = 0
    for flight in Flight.all
---
SELECT "flights".* FROM "flights"