app/controllers/flights_controller.rb

  def index
    @flights = Flight.where("destiny like :destiny and origin like :origin and date::text like :date and time::text like :time", destiny: "%#{params[:destiny]}%", origin: "%#{params[:origin]}%", date: "%#{params[:date]}%", time: "%#{params[:time]}%")
---
SELECT "flights".* FROM "flights" WHERE "flights"."destiny" = ?  [["destiny", "Hola"]]

  def show
    @flight = Flight.find(params[:id])
---
SELECT "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @flight = Flight.new(flight_params)

    ('A'...'F').each do |col|
      (1...24).each do |fil|
        @seat = @flight.seats.new(row:fil, column:col, disponibility:true)
        @seat.save
---
INSERT INTO "flights" ("date", "time", "origin", "destiny", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["date", "2022-06-01"], ["time", "2000-01-01 21:27:00"], ["origin", "Iqq"], ["destiny", "Stgo"], ["created_at", "2022-05-31 20:29:34.085705"], ["updated_at", "2022-05-31 20:29:34.085705"]]
INSERT INTO "seats" ("row", "column", "disponibility", "created_at", "updated_at", "flight_id") VALUES (?, ?, ?, ?, ?, ?)  [["row", 1], ["column", "A"], ["disponibility", 1], ["created_at", "2022-05-31 20:29:34.087908"], ["updated_at", "2022-05-31 20:29:34.087908"], ["flight_id", 1]]

  def destroy
    @flight = Flight.find(params[:id])
    @flight.destroy
---
SELECT "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "flights" WHERE "flights"."id" = ?  [["id", 2]]

  def ocupation(id)
    puts id
    @flight = Flight.find(id)
    @taken = 0
    @seats = @flight.seats.count
---
SELECT "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "flights" WHERE (date > '2022-06-11')
SELECT COUNT(*) FROM "seats" WHERE "seats"."flight_id" = ?  [["flight_id", 1]]

  def statistics
    @all = Flight.count
    @past = Flight.where("date < :datenow", datenow: Date.today).count
    @future = Flight.where("date > :datenow", datenow: Date.today).count
    @taken = 0
    @all_seats = 0
    @flights = Flight.all
---
SELECT COUNT(*) FROM "flights" WHERE (date > '2022-06-12')
SELECT "flights".* FROM "flights" WHERE (date < '2022-06-11')
SELECT "flights".* FROM "flights"